In [1]:
import pandas as pd

In [6]:
data_frame=pd.read_csv('C:\\Pandas\\test_csv_file.csv')

In [7]:
data_frame

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [10]:
data_frame.head(1)

   ID LAST_NAME  AGE
0   1       KIM   30

In [11]:
data_frame.tail(2)

   ID LAST_NAME  AGE
3   4      PARK   19
4   5       LIM   36

In [15]:
type(data_frame.AGE)

pandas.core.series.Series

In [17]:
type(data_frame.ID)

pandas.core.series.Series

In [18]:
list_tmp=[1,2,3]

In [19]:
list_tmp

[1, 2, 3]

In [26]:
s1=pd.core.series.Series([1,2,3,4,5])

In [27]:
s2=pd.core.series.Series(['one','two','three','four','five'])

In [28]:
pd.DataFrame(data=dict(num=s1,word=s2))

   num   word
0    1    one
1    2    two
2    3  three
3    4   four
4    5   five